{
  "name": "Fancy Words Generic",
  "items": [
    {
      "main": "Adept (uh-DEPT) – adjective",
      "subs": [
        "Highly skilled or proficient.",
        "a) She's pretty adept at fixing things around the house without looking it up.",
        "b) He's adept at picking the perfect restaurant for any mood."
      ]
    },
    {
      "main": "Adroit (uh-DROYT) – adjective",
      "subs": [
        "Clever, resourceful, and skillful.",
        "a) That was an adroit comeback—you had everyone laughing.",
        "b) She's adroit at finding cheap flights nobody else notices."
      ]
    },
    {
      "main": "Agile (AJ-uhl or AJ-ile) – adjective",
      "subs": [
        "Able to move or adapt quickly and easily.",
        "a) He's still surprisingly agile on the basketball court.",
        "b) She's agile when it comes to changing weekend plans last minute."
      ]
    },
    {
      "main": "Alacrity (uh-LAK-ri-tee) – noun",
      "subs": [
        "Cheerful readiness or willingness.",
        "a) He jumped up with alacrity when someone mentioned dessert.",
        "b) She agreed to karaoke with surprising alacrity."
      ]
    },
    {
      "main": "Ameliorate (uh-MEEL-yuh-rayt) – verb",
      "subs": [
        "To improve or make better.",
        "a) Adding hot sauce definitely ameliorated that bland pasta.",
        "b) A quick nap can ameliorate almost any bad mood."
      ]
    },
    {
      "main": "Apex (AY-peks) – noun",
      "subs": [
        "The highest point or peak.",
        "a) That road trip was the apex of our summer.",
        "b) The concert hit its apex when the lights dropped and the beat kicked in."
      ]
    },
    {
      "main": "Auspicious (aw-SPIH-shuhs) – adjective",
      "subs": [
        "Favorable, promising success.",
        "a) The sunny weather felt like an auspicious start to the picnic.",
        "b) Finding parking right in front was definitely auspicious."
      ]
    },
    {
      "main": "Avant-garde (ah-VAHNT-gaard) – adjective",
      "subs": [
        "Innovative, ahead of its time.",
        "a) That movie was so avant-garde I'm not sure I understood half of it.",
        "b) His outfit was… let's just say avant-garde compared to everyone else's."
      ]
    },
    {
      "main": "Beleaguered (bih-LEE-gerd) – adjective",
      "subs": [
        "Surrounded by difficulties or stress.",
        "a) She looked beleaguered after babysitting her nephews all day.",
        "b) My phone is beleaguered with group chat notifications."
      ]
    },
    {
      "main": "Benchmark (BENCH-mark) – noun",
      "subs": [
        "A standard or point of comparison.",
        "a) That vacation set the benchmark for all future vacations.",
        "b) This pizza is my benchmark for judging every other slice."
      ]
    },
    {
      "main": "Bespoke (bih-SPOHK) – adjective",
      "subs": [
        "Custom-made, tailored.",
        "a) He ordered a bespoke suit for the wedding.",
        "b) She made a bespoke playlist just for our road trip."
      ]
    },
    {
      "main": "Bolster (BOHL-stur) – verb",
      "subs": [
        "To support, strengthen, or reinforce.",
        "a) A quick snack bolstered my energy before the gym.",
        "b) That compliment bolstered his confidence right away."
      ]
    },
    {
      "main": "Brevity (BREV-i-tee) – noun",
      "subs": [
        "Concise and exact use of words.",
        "a) I admire the brevity of her texts—straight to the point.",
        "b) The brevity of the speech made it way more powerful."
      ]
    },
    {
      "main": "Catalyst (CAT-uh-list) – noun",
      "subs": [
        "Something that provokes or speeds change.",
        "a) That road trip was the catalyst for us moving in together.",
        "b) Coffee is often the catalyst for my productivity."
      ]
    },
    {
      "main": "Cerebral (suh-REE-bruhl) – adjective",
      "subs": [
        "Intellectual, brainy.",
        "a) That documentary was more cerebral than I expected.",
        "b) He loves cerebral conversations about philosophy over beer."
      ]
    },
    {
      "main": "Clairvoyant (klair-VOY-unt) – adjective",
      "subs": [
        "Intuitive, able to perceive beyond normal senses.",
        "a) She seemed almost clairvoyant about who was about to call.",
        "b) His timing felt clairvoyant—like he knew the joke was coming."
      ]
    },
    {
      "main": "Cohesive (koh-HEE-siv) – adjective",
      "subs": [
        "Forming a united whole.",
        "a) The playlist felt cohesive from start to finish.",
        "b) Our friend group is weirdly cohesive despite our differences."
      ]
    },
    {
      "main": "Colloquial (kuh-LOH-kwee-uhl) – adjective",
      "subs": [
        "Conversational, informal in style.",
        "a) He explained it in a colloquial way that made sense.",
        "b) I prefer podcasts that feel more colloquial and relaxed."
      ]
    },
    {
      "main": "Confluence (CON-floo-ence) – noun",
      "subs": [
        "The merging of two or more things.",
        "a) The confluence of music and art at that festival was unreal.",
        "b) Dinner was a confluence of leftovers that somehow worked."
      ]
    },
    {
      "main": "Congruent (KON-groo-ent) – adjective",
      "subs": [
        "In agreement, aligned.",
        "a) Their tastes in movies are surprisingly congruent.",
        "b) His words weren't congruent with his actions."
      ]
    },
    {
      "main": "Conspicuous (kun-SPIH-kyoo-uhs) – adjective",
      "subs": [
        "Easily noticeable, obvious.",
        "a) Her bright red jacket was conspicuous in the crowd.",
        "b) He made a conspicuous effort to avoid eye contact."
      ]
    },
    {
      "main": "Contemporary (kun-TEMP-uh-rer-ee) – adjective",
      "subs": [
        "Modern, belonging to the present.",
        "a) The café had a very contemporary design.",
        "b) She prefers contemporary novels over the classics."
      ]
    },
    {
      "main": "Conundrum (kuh-NUN-drum) – noun",
      "subs": [
        "A difficult or confusing problem.",
        "a) Figuring out dinner plans is always a conundrum.",
        "b) He faced the conundrum of choosing between two great offers."
      ]
    },
    {
      "main": "Cordial (KOR-juhl) – adjective",
      "subs": [
        "Warm and friendly.",
        "a) They gave us a cordial welcome at the party.",
        "b) He always keeps things cordial even in debates."
      ]
    },
    {
      "main": "Crux (kruks) – noun",
      "subs": [
        "The most important point or issue.",
        "a) The crux of the argument was who would drive.",
        "b) At the crux of it, we just wanted pizza."
      ]
    },
    {
      "main": "Curation (kyoo-RAY-shun) – noun",
      "subs": [
        "The act of carefully selecting and organizing.",
        "a) Her curation of memes is unmatched.",
        "b) The playlist was a perfect curation of 90s hits."
      ]
    },
    {
      "main": "Debacle (duh-BAH-kl or dee-BAH-kl) – noun",
      "subs": [
        "A sudden disaster or failure.",
        "a) The camping trip turned into a debacle when it rained nonstop.",
        "b) That group project was a total debacle."
      ]
    },
    {
      "main": "Decorum (duh-KOR-um) – noun",
      "subs": [
        "Proper behavior and etiquette.",
        "a) He handled the awkward moment with decorum.",
        "b) They tried to maintain decorum at the dinner table."
      ]
    },
    {
      "main": "Deft (deft) – adjective",
      "subs": [
        "Skillful and quick.",
        "a) She gave a deft shuffle of the cards.",
        "b) He's deft with chopsticks."
      ]
    },
    {
      "main": "Demarcation (dee-mar-KAY-shun) – noun",
      "subs": [
        "The setting of boundaries.",
        "a) There was a clear demarcation between their chores.",
        "b) The fence was a demarcation of property lines."
      ]
    },
    {
      "main": "Derivative (duh-RIV-uh-tiv) – adjective",
      "subs": [
        "Imitative, lacking originality.",
        "a) That song felt derivative of a 2000s pop hit.",
        "b) His joke was funny but definitely derivative."
      ]
    },
    {
      "main": "Dichotomy (dy-KOT-uh-mee) – noun",
      "subs": [
        "A division between two opposing things.",
        "a) There's a funny dichotomy between cats and dogs.",
        "b) Her style shows a dichotomy of comfort and glam."
      ]
    },
    {
      "main": "Disparate (DIS-puh-rit) – adjective",
      "subs": [
        "Essentially different in kind.",
        "a) They have disparate tastes in music.",
        "b) It's hard to compare such disparate hobbies."
      ]
    },
    {
      "main": "Dissonance (DIS-uh-nuns) – noun",
      "subs": [
        "Lack of harmony or agreement.",
        "a) The dissonance in that song made it sound spooky.",
        "b) There was dissonance between what he said and what he did."
      ]
    },
    {
      "main": "Dynamic (dy-NAM-ik) – adjective",
      "subs": [
        "Constantly changing, full of energy.",
        "a) The conversation was so dynamic it kept everyone engaged.",
        "b) She's a dynamic personality in any group."
      ]
    },
    {
      "main": "Echelon (ESH-uh-lon) – noun",
      "subs": [
        "A level or rank.",
        "a) He's moving up the echelons of the gaming world.",
        "b) That restaurant is in a different echelon of dining."
      ]
    },
    {
      "main": "Efficacy (EF-uh-kuh-see) – noun",
      "subs": [
        "Effectiveness at producing results.",
        "a) The efficacy of that new face cream is questionable.",
        "b) We tested the efficacy of leaving earlier to beat traffic."
      ]
    },
    {
      "main": "Effusive (ih-FYOO-siv) – adjective",
      "subs": [
        "Expressing feelings freely and enthusiastically.",
        "a) She was effusive about how good the tacos were.",
        "b) His effusive hugs make everyone feel welcome."
      ]
    },
    {
      "main": "Eloquent (EL-uh-kwent) – adjective",
      "subs": [
        "Fluent and persuasive in speaking or writing.",
        "a) He gave an eloquent toast at the wedding.",
        "b) Her Instagram captions are weirdly eloquent."
      ]
    },
    {
      "main": "Embellish (em-BEL-ish) – verb",
      "subs": [
        "To decorate or exaggerate.",
        "a) He embellished the story to make it funnier.",
        "b) She likes to embellish her outfits with funky jewelry."
      ]
    },
    {
      "main": "Empirical (em-PEER-ih-kuhl) – adjective",
      "subs": [
        "Based on observation or evidence.",
        "a) Her theory was cool, but he wanted something more empirical.",
        "b) The recipe is purely empirical—I just kept adding stuff until it tasted good."
      ]
    },
    {
      "main": "Endemic (en-DEM-ik) – adjective",
      "subs": [
        "Regularly found in a particular place or among a group.",
        "a) Coffee shops are basically endemic to big cities.",
        "b) That slang is endemic to teenagers on TikTok."
      ]
    },
    {
      "main": "Enigmatic (en-ig-MAT-ik) – adjective",
      "subs": [
        "Mysterious, puzzling.",
        "a) He gave an enigmatic smile and didn't explain further.",
        "b) The ending of that movie was super enigmatic."
      ]
    },
    {
      "main": "Ephemeral (eh-FEM-er-uhl) – adjective",
      "subs": [
        "Lasting for a short time.",
        "a) The sunset was beautiful but ephemeral.",
        "b) My interest in kale smoothies was pretty ephemeral."
      ]
    },
    {
      "main": "Equanimity (ee-kwuh-NIM-ih-tee) – noun",
      "subs": [
        "Calmness under pressure.",
        "a) She handled the chaos with surprising equanimity.",
        "b) Even with traffic, he drove with equanimity."
      ]
    },
    {
      "main": "Equitable (EK-wih-tuh-buhl) – adjective",
      "subs": [
        "Fair and impartial.",
        "a) They split the bill in an equitable way.",
        "b) It felt equitable to let everyone take a turn."
      ]
    },
    {
      "main": "Erudite (ER-oo-dite) – adjective",
      "subs": [
        "Deeply learned, scholarly.",
        "a) He gave an erudite explanation of the wine list.",
        "b) Her bookshelf made her look way more erudite than she admitted."
      ]
    },
    {
      "main": "Esoteric (eh-so-TER-ik) – adjective",
      "subs": [
        "Known or understood by only a few.",
        "a) That podcast is so esoteric I've never met anyone else who listens.",
        "b) His jokes are funny but way too esoteric sometimes."
      ]
    },
    {
      "main": "Ethereal (ih-THEER-ee-uhl) – adjective",
      "subs": [
        "Delicate, light, almost otherworldly.",
        "a) The singer's voice was ethereal live.",
        "b) The fog gave the park an ethereal vibe."
      ]
    },
    {
      "main": "Euphemism (YOO-fuh-miz-um) – noun",
      "subs": [
        "A mild or indirect word for something harsh.",
        "a) They called it \"downsizing,\" which was just a euphemism for layoffs.",
        "b) \"Creative differences\" is Hollywood's favorite euphemism."
      ]
    },
    {
      "main": "Exemplary (ig-ZEM-pluh-ree) – adjective",
      "subs": [
        "Serving as a model or example.",
        "a) Her cooking skills are exemplary.",
        "b) He got an exemplary score on the exam."
      ]
    },
    {
      "main": "Expedient (ek-SPEE-dee-uhnt) – adjective",
      "subs": [
        "Convenient, though maybe not the best.",
        "a) Ordering takeout was the expedient choice.",
        "b) He gave an expedient excuse just to end the conversation."
      ]
    },
    {
      "main": "Facade (fuh-SAHD) – noun",
      "subs": [
        "An outward appearance that hides the truth.",
        "a) Her calm tone was just a facade—she was stressed.",
        "b) That store's fancy facade hides a pretty small shop inside."
      ]
    },
    {
      "main": "Facetious (fuh-SEE-shus) – adjective",
      "subs": [
        "Joking, often inappropriately.",
        "a) Stop being facetious, I'm actually asking for advice.",
        "b) His facetious comment made everyone roll their eyes."
      ]
    },
    {
      "main": "Fastidious (fa-STID-ee-us) – adjective",
      "subs": [
        "Very attentive to detail.",
        "a) He's fastidious about folding laundry a certain way.",
        "b) She's fastidious when it comes to her coffee order."
      ]
    },
    {
      "main": "Feasible (FEE-zuh-buhl) – adjective",
      "subs": [
        "Possible, practical.",
        "a) It's feasible to bike there in under 20 minutes.",
        "b) Making pasta from scratch sounds nice but not feasible on a Tuesday."
      ]
    },
    {
      "main": "Fortuitous (for-TOO-ih-tus) – adjective",
      "subs": [
        "Happening by chance, often lucky.",
        "a) Running into him was totally fortuitous.",
        "b) It was fortuitous that the rain stopped right before the wedding."
      ]
    },
    {
      "main": "Furtive (FUR-tiv) – adjective",
      "subs": [
        "Secretive, sly.",
        "a) He gave a furtive glance at the dessert menu.",
        "b) Their furtive whispers made us suspicious."
      ]
    },
    {
      "main": "Galvanize (GAL-vuh-nize) – verb",
      "subs": [
        "To inspire or shock into action.",
        "a) The coach's speech galvanized the team.",
        "b) Her rant galvanized us to actually clean the apartment."
      ]
    },
    {
      "main": "Gamut (GAM-ut) – noun",
      "subs": [
        "The full range or scope.",
        "a) That playlist runs the gamut from jazz to heavy metal.",
        "b) He experienced the whole gamut of emotions in one day."
      ]
    },
    {
      "main": "Gauntlet (GAWNT-lit) – noun",
      "subs": [
        "A challenge or trial.",
        "a) The commute in rush hour is a daily gauntlet.",
        "b) She ran the gauntlet of tough questions from friends."
      ]
    },
    {
      "main": "Grandiose (GRAN-dee-ohs) – adjective",
      "subs": [
        "Impressive or ambitious, sometimes overblown.",
        "a) He had grandiose plans for the weekend that never happened.",
        "b) Her grandiose birthday party included a live band and fireworks."
      ]
    },
    {
      "main": "Gravitas (GRAH-vi-tahs) – noun",
      "subs": [
        "Seriousness, dignity, or weight.",
        "a) The teacher spoke with real gravitas.",
        "b) That speech lacked gravitas but made up for it with humor."
      ]
    },
    {
      "main": "Harbinger (HAR-bin-jer) – noun",
      "subs": [
        "A sign of things to come.",
        "a) The early snow was a harbinger of a long winter.",
        "b) Her yawns were a harbinger that the party was ending."
      ]
    },
    {
      "main": "Hedonistic (hee-duh-NIS-tik) – adjective",
      "subs": [
        "Pleasure-seeking, indulgent.",
        "a) His hedonistic weekend was all about food and naps.",
        "b) The vacation felt delightfully hedonistic."
      ]
    },
    {
      "main": "Holistic (ho-LIS-tik) – adjective",
      "subs": [
        "Considering the whole, not just parts.",
        "a) She takes a holistic approach to health—diet, sleep, exercise.",
        "b) We need a holistic plan for the house, not just new paint."
      ]
    },
    {
      "main": "Hubris (HYOO-bris) – noun",
      "subs": [
        "Excessive pride or self-confidence.",
        "a) His hubris made him underestimate the hike.",
        "b) The team's hubris led to a crushing defeat."
      ]
    },
    {
      "main": "Iconoclast (eye-KON-uh-klast) – noun",
      "subs": [
        "A person who challenges traditions or beliefs.",
        "a) She's an iconoclast in fashion—never follows trends.",
        "b) That comedian is a real iconoclast, taking shots at everything sacred."
      ]
    },
    {
      "main": "Idiosyncratic (id-ee-oh-sin-KRAT-ik) – adjective",
      "subs": [
        "Unique or peculiar to an individual.",
        "a) Her idiosyncratic laugh makes everyone smile.",
        "b) He has an idiosyncratic way of organizing his desk."
      ]
    },
    {
      "main": "Illicit (ih-LIS-it) – adjective",
      "subs": [
        "Forbidden, illegal.",
        "a) They were caught with illicit fireworks.",
        "b) He has an illicit stash of candy in his drawer."
      ]
    },
    {
      "main": "Impetuous (im-PECH-oo-us) – adjective",
      "subs": [
        "Acting quickly without thought.",
        "a) Her impetuous road trip led to some great memories.",
        "b) He made an impetuous purchase he later regretted."
      ]
    },
    {
      "main": "Incessant (in-SESS-unt) – adjective",
      "subs": [
        "Continuing without stopping.",
        "a) The incessant barking drove the neighbors crazy.",
        "b) Her incessant texting kept the group chat alive all night."
      ]
    },
    {
      "main": "Incisive (in-SY-siv) – adjective",
      "subs": [
        "Sharp, clear, and direct.",
        "a) Her incisive comment ended the debate instantly.",
        "b) He has an incisive way of cutting through small talk."
      ]
    },
    {
      "main": "Incremental (in-kru-MEN-tl) – adjective",
      "subs": [
        "Happening gradually in steps.",
        "a) His progress at the gym was incremental but steady.",
        "b) They made incremental changes to the recipe until it was perfect."
      ]
    },
    {
      "main": "Indelible (in-DEL-ih-buhl) – adjective",
      "subs": [
        "Unforgettable, permanent.",
        "a) That concert left an indelible impression on me.",
        "b) The marker stain was indelible on his shirt."
      ]
    },
    {
      "main": "Ineffable (in-EF-uh-buhl) – adjective",
      "subs": [
        "Too great to be described in words.",
        "a) The view from the mountain was ineffable.",
        "b) Her joy was ineffable when she got the news."
      ]
    },
    {
      "main": "Ingratiate (in-GRAY-shee-ate) – verb",
      "subs": [
        "To gain favor by flattery.",
        "a) He tried to ingratiate himself with the group by telling jokes.",
        "b) She ingratiated herself with the teacher by always volunteering."
      ]
    },
    {
      "main": "Innate (ih-NAYT) – adjective",
      "subs": [
        "Natural, inborn.",
        "a) He has an innate talent for storytelling.",
        "b) Her sense of rhythm is just innate."
      ]
    },
    {
      "main": "Insidious (in-SID-ee-us) – adjective",
      "subs": [
        "Subtly harmful.",
        "a) That insidious rumor spread before anyone noticed.",
        "b) The app's insidious notifications drained his focus."
      ]
    },
    {
      "main": "Intrepid (in-TREP-id) – adjective",
      "subs": [
        "Fearless, adventurous.",
        "a) The intrepid hikers camped in the storm.",
        "b) She's intrepid when it comes to trying spicy food."
      ]
    },
    {
      "main": "Juxtapose (JUK-stuh-pohz) – verb",
      "subs": [
        "To place side by side for contrast.",
        "a) The mural juxtaposes old graffiti with modern art.",
        "b) She likes to juxtapose sneakers with fancy dresses."
      ]
    },
    {
      "main": "Kinetic (kih-NET-ik) – adjective",
      "subs": [
        "Relating to motion, energetic.",
        "a) The dance had so much kinetic energy.",
        "b) That action scene was pure kinetic chaos."
      ]
    },
    {
      "main": "Laudable (LAW-duh-buhl) – adjective",
      "subs": [
        "Praiseworthy.",
        "a) His effort to cook dinner was laudable, even if it burned.",
        "b) Volunteering on weekends is a laudable habit."
      ]
    },
    {
      "main": "Liminal (LIM-uh-nl) – adjective",
      "subs": [
        "At a threshold or transition point.",
        "a) Graduation felt like a liminal moment in life.",
        "b) The airport is such a liminal space—between here and there."
      ]
    },
    {
      "main": "Loquacious (loh-KWAY-shus) – adjective",
      "subs": [
        "Very talkative.",
        "a) He gets loquacious after a couple of drinks.",
        "b) Her loquacious storytelling kept us entertained for hours."
      ]
    },
    {
      "main": "Lucid (LOO-sid) – adjective",
      "subs": [
        "Clear and easy to understand.",
        "a) Her explanation of taxes was surprisingly lucid.",
        "b) He had a lucid dream about flying last night."
      ]
    },
    {
      "main": "Magnanimous (mag-NAN-ih-mus) – adjective",
      "subs": [
        "Generous, forgiving.",
        "a) She was magnanimous in victory, thanking her opponent.",
        "b) He made a magnanimous gesture by picking up the check."
      ]
    },
    {
      "main": "Malfeasance (mal-FEE-zuns) – noun",
      "subs": [
        "Wrongdoing, often by an official.",
        "a) The mayor resigned after being accused of malfeasance.",
        "b) Corporate malfeasance is a favorite theme in movies."
      ]
    },
    {
      "main": "Mellifluous (muh-LIF-loo-us) – adjective",
      "subs": [
        "Sweet-sounding, smooth.",
        "a) Her mellifluous singing put the baby to sleep.",
        "b) The narrator's mellifluous voice made the audiobook addictive."
      ]
    },
    {
      "main": "Meticulous (meh-TIK-yoo-lus) – adjective",
      "subs": [
        "Extremely careful with detail.",
        "a) He's meticulous about arranging his vinyl collection.",
        "b) She was meticulous in planning the surprise party."
      ]
    },
    {
      "main": "Modicum (MOD-ih-kum) – noun",
      "subs": [
        "A small amount.",
        "a) There's not a modicum of truth in that rumor.",
        "b) He had a modicum of patience left after waiting an hour."
      ]
    },
    {
      "main": "Nascent (NAY-sent) – adjective",
      "subs": [
        "Just beginning, emerging.",
        "a) The nascent band already has a cult following.",
        "b) That idea is still nascent, but it could be huge."
      ]
    },
    {
      "main": "Nebulous (NEB-yoo-lus) – adjective",
      "subs": [
        "Vague, unclear.",
        "a) His explanation was so nebulous I gave up.",
        "b) The rules for the contest were pretty nebulous."
      ]
    },
    {
      "main": "Nefarious (neh-FAIR-ee-us) – adjective",
      "subs": [
        "Wicked, evil.",
        "a) The villain's nefarious plan failed spectacularly.",
        "b) She gave the cat a nefarious look before spraying it with water."
      ]
    },
    {
      "main": "Nuance (NOO-ahnss) – noun",
      "subs": [
        "A subtle distinction or detail.",
        "a) He caught the nuance in her tone immediately.",
        "b) The debate was full of nuance most people missed."
      ]
    },
    {
      "main": "Obfuscate (OB-fuh-skayt) – verb",
      "subs": [
        "To confuse or make unclear.",
        "a) All that legal jargon just obfuscated the issue.",
        "b) He tends to obfuscate when he doesn't want to answer directly."
      ]
    },
    {
      "main": "Omnipresent (om-nee-PREZ-unt) – adjective",
      "subs": [
        "Present everywhere.",
        "a) Smartphones are basically omnipresent now.",
        "b) Her perfume was omnipresent in the room."
      ]
    },
    {
      "main": "Ostentatious (os-ten-TAY-shus) – adjective",
      "subs": [
        "Showy, designed to impress.",
        "a) He drove an ostentatious sports car to the reunion.",
        "b) Her ostentatious jewelry sparkled from across the room."
      ]
    },
    {
      "main": "Paradigm (PAIR-uh-dyme) – noun",
      "subs": [
        "A model or pattern of something.",
        "a) Streaming is the new paradigm for watching TV.",
        "b) That app set a new paradigm for convenience."
      ]
    },
    {
      "main": "Paradox (PAIR-uh-doks) – noun",
      "subs": [
        "A statement that seems contradictory but may be true.",
        "a) It's a paradox that silence can be louder than words.",
        "b) The more he prepared, the more nervous he felt—a real paradox."
      ]
    }
  ]
}

